Repository: Autive/lease-boot-button
Catalog: languages/autive-lbb-*.po
Languages: nl_nl

source: You need to set the Dynamic container in the Leaseboot plugin settings to make it work dynamically.
nl_nl: U moet de Dynamische container instellen in de instellingen van de Leaseboot plugin om het dynamisch te laten werken.

source: Leaseboot Button Settings
nl_nl: Leaseboot instellingen

source: Here you can change the general settings.
nl_nl: Hier kunt u de algemene instellingen wijzigen.

source: Example background
nl_nl: Voorbeeld achtergrond

source: Example price
nl_nl: Voorbeeld prijs

source: Button text
nl_nl: Knop tekst

source: Price text
nl_nl: Prijstekst

source: You can use {price} for the monthly price and {amount} for the total cost of the boat.
nl_nl: U kunt {price} gebruiken voor de maandelijkse prijs en {amount} voor de totale kosten van de boot.

source: Deactivate plugin styling
nl_nl: Plugin-styling deactiveren

source: If you decide to deactivate the button styling make sure your theme does add the correct styling.
nl_nl: Als u besluit om de styling van de knop uit te schakelen, zorg er dan voor dat uw thema de juiste styling toevoegt.

source: Here you can change the styling of the button.
nl_nl: Hier kunt u de vormgeving van de knop wijzigen.

source: Button classes
nl_nl: Knop classes

source: Button alignment
nl_nl: Knoppen uitlijning

source: Left
nl_nl: Links

source: Center
nl_nl: Midden

source: Right
nl_nl: Rechts

source: Button background color
nl_nl: Knop achtergrondkleur

source: Button font color
nl_nl: Knop lettertype kleur

source: Button font size
nl_nl: ï»¿Knop lettertype grote

source: Button font weight
nl_nl: Knop lettertype dikte

source: Button border color
nl_nl: Knop randkleur

source: Button border thickness
nl_nl: Knop randdikte

source: Button border radius
nl_nl: Knop rand ronding

source: Button padding x
nl_nl: Knop padding x

source: Button padding y
nl_nl: Knop padding y

source: Here you can change the styling of the text. If you decide to not activate the styling make sure your theme does style the text.
nl_nl: Hier kunt u de opmaak van de tekst wijzigen. Als u besluit de opmaak niet te activeren, zorg er dan voor dat uw thema de tekst wel opmaakt.

source: Deactivate text
nl_nl: Tekst deactiveren

source: If you disable the text the monthly price is not shown anymore.
nl_nl: Als u de tekst uitschakelt, wordt de maandprijs niet meer weergegeven.

source: Text classes
nl_nl: Tekst classes

source: Text alignment
nl_nl: Tekstuitlijning

source: Text color
nl_nl: Tekstkleur

source: Text font size
nl_nl: Tekstgrootte

source: Text font weight
nl_nl: Tekstdikte

source: Text padding x
nl_nl: Tekst padding x

source: Text padding y
nl_nl: Tekst padding y

source: Here you can change the dynamic settings.
nl_nl: Hier kunt u de dynamische instellingen wijzigen.

source: Activate dynamic pricing
nl_nl: Dynamische prijzen activeren

source: Make sure to add a # or . in this field to be able to target either an id or class.
nl_nl: Zorg ervoor dat u een # of . in dit veld toevoegt om een id of class te kunnen targeten.

source: We assume you use Dutch currency format (1.000,00) and will strip any non numerical content.
nl_nl: Wij gaan ervan uit dat u het Nederlandse valutaformaat (1.000,00) gebruikt en alle niet numerieke inhoud verwijdert.

source: You can use the shortcode [lease-boot-button] to add the button to your website with the following attributes:
nl_nl: U kunt de shortcode [lease-boot-button] gebruiken om de knop aan uw website toe te voegen met de volgende attributen:

source: The price of the boat
nl_nl: De prijs van de boot

source: The text of the button (optional)
nl_nl: De tekst van de knop (optioneel)

source: The text of the price (optional)
nl_nl: De tekst van de prijs (optioneel)

source: You can use the following PHP code to get an instance of the button:
nl_nl: U kunt de volgende PHP-code gebruiken om een instantie van de knop te krijgen:

source: You can use the following attributes in order to change the button:
nl_nl: U kunt de volgende attributen gebruiken om de knop te wijzigen:

source: $price (int) the total price of the object, mandatory.
nl_nl: $price (int) de totale prijs van het object, verplicht.

source: $text (string) the text of the price, optional.
nl_nl: $text (tekenreeks) de tekst van de prijs, optioneel.

source: $button_txt (string) the text of the button, optional.
nl_nl: $button_txt (string) de tekst van de knop, optioneel.

source: $button_classes (string) the classes of the button, optional.
nl_nl: $button_classes (string) de classes van de knop, optioneel.

source: $text_deactivate (bool) deactivate the text, optional.
nl_nl: $text_deactivate (bool) deactiveert de tekst, optioneel.

source: $text_classes (string) the classes of the text container, optional.
nl_nl: $text_classes (string) de classes van de tekstcontainer, optioneel.

source: You need to add variables in order, so if you only want to disable the text use the following.
nl_nl: U moet variabelen in volgorde toevoegen, dus als u alleen de tekst wilt uitschakelen, gebruikt u het volgende.

source: Then you can use the following function to render the html:
nl_nl: Vervolgens kunt u de volgende functie gebruiken om de html te renderen:

source: PHP - price
nl_nl: PHP - prijs

source: You can use the following PHP code to only get the monthly price:
nl_nl: U kunt de volgende PHP-code gebruiken om alleen de maandprijs te krijgen:

source: You can use the following PHP code to only get the url:
nl_nl: U kunt de volgende PHP-code gebruiken om alleen de url te krijgen:

source: Dynamic pricing
nl_nl: Dynamische prijzen

source: You can use AJAX to make the button dynamic:
nl_nl: U kunt AJAX gebruiken om de knop dynamisch te maken:

source: To do this make sure to enable Dynamic pricing on the Dynamic tab,
nl_nl: Om dit te doen, moet u Dynamische prijzen inschakelen op het tabblad Dynamisch,

source: This will add Javascript to your website which will listen to changes to the price inside the given container.
nl_nl: Hiermee voegt u Javascript aan uw website toe dat luistert naar wijzigingen in de prijs binnen de opgegeven container.

source: When the price changes the button will be updated with the correct price, amount and url.
nl_nl: Als de prijs verandert, wordt de knop bijgewerkt met de juiste prijs, het juiste bedrag en de juiste url.

source: General
nl_nl: Algemeen

source: Button styling
nl_nl: Knopstyling

source: Text styling
nl_nl: Tekst opmaak

source: Dynamic
nl_nl: Dynamisch

source: Lease Boot Button plugin
nl_nl: Leaseboot knop plugin

source: A plugin to add the leaseboot.com button to a website.
nl_nl: Een plugin om de leaseboot.com knop aan een website toe te voegen.
